### matplotlib
: 파이썬의 표준 시각화 도구

#### 선그래프
###### 추세

In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

import warnings
warnings.filterwarnings('ignore')

In [20]:
df = pd.read_excel("../Data/시도별 전출입 인구수.xlsx")
df.head()

,전출지별,전입지별,1970,1971,1972,1973,1974,1975,1976,1977,...,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017
0,전출지별,전입지별,이동자수 (명),이동자수 (명),이동자수 (명),이동자수 (명),이동자수 (명),이동자수 (명),이동자수 (명),이동자수 (명),...,이동자수 (명),이동자수 (명),이동자수 (명),이동자수 (명),이동자수 (명),이동자수 (명),이동자수 (명),이동자수 (명),이동자수 (명),이동자수 (명)
1,전국,전국,4046536,4210164,3687938,4860418,5297969,9011440,6773250,7397623,...,8808256,8487275,8226594,8127195,7506691,7411784,7629098,7755286,7378430,7154226
2,NaN,서울특별시,1742813,1671705,1349333,1831858,2050392,3396662,2756510,2893403,...,2025358,1873188,1733015,1721748,1555281,1520090,1573594,1589431,1515602,1472937
3,NaN,부산광역시,448577,389797,362202,482061,680984,805979,724664,785117,...,514502,519310,519334,508043,461042,478451,485710,507031,459015,439073
4,NaN,대구광역시,-,-,-,-,-,-,-,-,...,409938,398626,370817,370563,348642,351873,350213,351424,328228,321182

In [6]:
df.tail()

,전출지별,전입지별,1970,1971,1972,1973,1974,1975,1976,1977,...,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017
320,NaN,전라북도,139,202,141,210,219,415,392,408,...,668,579,672,561,551,516,609,683,733,768
321,NaN,전라남도,631,965,857,952,1133,2808,2608,2652,...,1143,1123,1002,1026,966,1001,928,1062,1127,1102
322,NaN,경상북도,374,619,468,576,625,1123,1141,1004,...,761,704,738,756,699,781,728,903,931,994
323,NaN,경상남도,474,479,440,571,1208,1517,863,1122,...,1517,1474,1324,1367,1227,1278,1223,1500,1448,1501
324,NaN,제주특별자치도,9290,12427,12210,16158,19580,34221,23291,31028,...,59564,55673,55507,59846,54280,60607,59673,59036,66444,63275

In [8]:
df.shape

(325, 50)

In [9]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 325 entries, 0 to 324
Data columns (total 50 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   전출지별    19 non-null     str
 1   전입지별    325 non-null    str
 2   1970    325 non-null    object
 3   1971    325 non-null    object
 4   1972    325 non-null    object
 5   1973    325 non-null    object
 6   1974    325 non-null    object
 7   1975    325 non-null    object
 8   1976    325 non-null    object
 9   1977    325 non-null    object
 10  1978    325 non-null    object
 11  1979    325 non-null    object
 12  1980    325 non-null    object
 13  1981    325 non-null    object
 14  1982    325 non-null    object
 15  1983    325 non-null    object
 16  1984    325 non-null    object
 17  1985    325 non-null    object
 18  1986    325 non-null    object
 19  1987    325 non-null    object
 20  1988    325 non-null    object
 21  1989    325 non-null    object
 22  1990    325 non-null    object
 23  1991    325 non-null    object
 24  1992    325 non-null    object
 25  1993    325 non-null    object
 26  1994    325 non-null    object
 27  1995    325 non-null    object
 28  1996    325 non-null    object
 29  1997    325 non-null    object
 30  1998    325 non-null    object
 31  1999    325 non-null    object
 32  2000    325 non-null    object
 33  2001    325 non-null    object
 34  2002    325 non-null    object
 35  2003    325 non-null    object
 36  2004    325 non-null    object
 37  2005    325 non-null    object
 38  2006    325 non-null    object
 39  2007    325 non-null    object
 40  2008    325 non-null    object
 41  2009    325 non-null    object
 42  2010    325 non-null    object
 43  2011    325 non-null    object
 44  2012    325 non-null    object
 45  2013    325 non-null    object
 46  2014    325 non-null    object
 47  2015    325 non-null    object
 48  2016    325 non-null    object
 49  2017    325 non-null    object
dtypes: object(48), str(2)
memory usage: 127.1+ KB

In [ ]:
# 행번호 0을 삭제하기
df.drop(
    index=0,
    inplace=True
)

# df.drop(
#     0,
#     axis = 'rows',
#     inplace=True
# )

In [26]:
df.reset_index(
    drop=True,
    inplace=True
)
df.head()

,전출지별,전입지별,1970,1971,1972,1973,1974,1975,1976,1977,...,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017
0,전국,전국,4046536,4210164,3687938,4860418,5297969,9011440,6773250,7397623,...,8808256,8487275,8226594,8127195,7506691,7411784,7629098,7755286,7378430,7154226
1,NaN,서울특별시,1742813,1671705,1349333,1831858,2050392,3396662,2756510,2893403,...,2025358,1873188,1733015,1721748,1555281,1520090,1573594,1589431,1515602,1472937
2,NaN,부산광역시,448577,389797,362202,482061,680984,805979,724664,785117,...,514502,519310,519334,508043,461042,478451,485710,507031,459015,439073
3,NaN,대구광역시,-,-,-,-,-,-,-,-,...,409938,398626,370817,370563,348642,351873,350213,351424,328228,321182
4,NaN,인천광역시,-,-,-,-,-,-,-,-,...,565585,478169,462051,499567,468666,461613,452297,473223,441646,409465

In [ ]:
# NaN 처리 : NaN을 앞의 데이터로 채움

df.ffill(
   
    inplace=True
) # 앞에 있는 데이터를 채움. 바로 뒤의 데이터를 채우는 bfill
df.head()

,전출지별,전입지별,1970,1971,1972,1973,1974,1975,1976,1977,...,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017
0,전국,전국,4046536,4210164,3687938,4860418,5297969,9011440,6773250,7397623,...,8808256,8487275,8226594,8127195,7506691,7411784,7629098,7755286,7378430,7154226
1,전국,서울특별시,1742813,1671705,1349333,1831858,2050392,3396662,2756510,2893403,...,2025358,1873188,1733015,1721748,1555281,1520090,1573594,1589431,1515602,1472937
2,전국,부산광역시,448577,389797,362202,482061,680984,805979,724664,785117,...,514502,519310,519334,508043,461042,478451,485710,507031,459015,439073
3,전국,대구광역시,-,-,-,-,-,-,-,-,...,409938,398626,370817,370563,348642,351873,350213,351424,328228,321182
4,전국,인천광역시,-,-,-,-,-,-,-,-,...,565585,478169,462051,499567,468666,461613,452297,473223,441646,409465

---
#### 년도 컬럼의 데이터가 object로 되어있어 숫자로 변환

In [35]:
df['1970'].unique()

array([4046536, 1742813, 448577, '-', 452060, 160959, 100041, 192979,
       136856, 177536, 407643, 212521, 14551, 1448985, 1232619, 11568,
       130149, 9352, 6700, 15954, 10814, 10513, 11868, 8409, 1039, 376059,
       24263, 307900, 6350, 2090, 1031, 1901, 1105, 2613, 7791, 20249,
       766, 353535, 95388, 4983, 212365, 7649, 4424, 10743, 3221, 4287,
       6171, 3916, 388, 197181, 34563, 4385, 16420, 113485, 7971, 3363,
       1199, 1355, 10916, 3279, 245, 147916, 37625, 3840, 12585, 5741,
       65127, 11611, 915, 3087, 5833, 1481, 71, 240241, 67033, 4803,
       19969, 3384, 5784, 121675, 4511, 5571, 4848, 2465, 198, 228126,
       71785, 6633, 14174, 2042, 1184, 12842, 104671, 8043, 4319, 2103,
       330, 263908, 75871, 9635, 15123, 2217, 1277, 5713, 7292, 137252,
       4377, 3709, 1442, 470142, 59129, 28676, 14210, 10325, 5155, 4623,
       1540, 2105, 326668, 17419, 292, 299797, 40077, 64731, 9571, 4219,
       1346, 2370, 1429, 2075, 24476, 149016, 487, 17705, 3881, 1418, 727,
       435, 42, 294, 139, 631, 374, 474, 9290], dtype=object)

In [36]:
# 1970컬럼의 전체갯수
df['1970'].count()

np.int64(324)

In [39]:
# -으로 등록되어 있는 데이터의 수
len(df[df['1970'] == '-'])

180

In [40]:
# -이 아닌 등록되어 있는 데이터의 수
len(df[df['1970'] != '-'])

144

In [53]:
# -을 0으로 대체.
df.replace(
    '-',
    0,
    inplace=True
)
df.head()

,전출지별,전입지별,1970,1971,1972,1973,1974,1975,1976,1977,...,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017
0,전국,전국,4046536,4210164,3687938,4860418,5297969,9011440,6773250,7397623,...,8808256,8487275,8226594,8127195,7506691,7411784,7629098,7755286,7378430,7154226
1,전국,서울특별시,1742813,1671705,1349333,1831858,2050392,3396662,2756510,2893403,...,2025358,1873188,1733015,1721748,1555281,1520090,1573594,1589431,1515602,1472937
2,전국,부산광역시,448577,389797,362202,482061,680984,805979,724664,785117,...,514502,519310,519334,508043,461042,478451,485710,507031,459015,439073
3,전국,대구광역시,0,0,0,0,0,0,0,0,...,409938,398626,370817,370563,348642,351873,350213,351424,328228,321182
4,전국,인천광역시,0,0,0,0,0,0,0,0,...,565585,478169,462051,499567,468666,461613,452297,473223,441646,409465

In [ ]:
df.info()

year_cols = df.columns[2:]
df[year_cols] = df[year_cols].apply(pd.to_numeric)

<class 'pandas.DataFrame'>
RangeIndex: 324 entries, 0 to 323
Data columns (total 50 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   전출지별    324 non-null    str
 1   전입지별    324 non-null    str
 2   1970    324 non-null    int64
 3   1971    324 non-null    int64
 4   1972    324 non-null    int64
 5   1973    324 non-null    int64
 6   1974    324 non-null    int64
 7   1975    324 non-null    int64
 8   1976    324 non-null    int64
 9   1977    324 non-null    int64
 10  1978    324 non-null    int64
 11  1979    324 non-null    int64
 12  1980    324 non-null    int64
 13  1981    324 non-null    int64
 14  1982    324 non-null    int64
 15  1983    324 non-null    int64
 16  1984    324 non-null    int64
 17  1985    324 non-null    int64
 18  1986    324 non-null    int64
 19  1987    324 non-null    int64
 20  1988    324 non-null    int64
 21  1989    324 non-null    int64
 22  1990    324 non-null    int64
 23  1991    324 non-null    int64
 24  1992    324 non-null    int64
 25  1993    324 non-null    int64
 26  1994    324 non-null    int64
 27  1995    324 non-null    int64
 28  1996    324 non-null    int64
 29  1997    324 non-null    int64
 30  1998    324 non-null    int64
 31  1999    324 non-null    int64
 32  2000    324 non-null    int64
 33  2001    324 non-null    int64
 34  2002    324 non-null    int64
 35  2003    324 non-null    int64
 36  2004    324 non-null    int64
 37  2005    324 non-null    int64
 38  2006    324 non-null    int64
 39  2007    324 non-null    int64
 40  2008    324 non-null    int64
 41  2009    324 non-null    int64
 42  2010    324 non-null    int64
 43  2011    324 non-null    int64
 44  2012    324 non-null    int64
 45  2013    324 non-null    int64
 46  2014    324 non-null    int64
 47  2015    324 non-null    int64
 48  2016    324 non-null    int64
 49  2017    324 non-null    int64
dtypes: int64(48), str(2)
memory usage: 126.7 KB

---
#### 서울에서 다른 지역으로 이동한 데이터만 추출

In [ ]:
df_seoul = df.loc[1, :]
df_seoul

전출지별         전국
전입지별      서울특별시
1970    1742813
1971    1671705
1972    1349333
1973    1831858
1974    2050392
1975    3396662
1976    2756510
1977    2893403
1978    3307439
1979    2589667
1980    2767816
1981    2859860
1982    2997854
1983    3434184
1984    3052558
1985    2784387
1986    2683013
1987    2853398
1988    3388387
1989    3049117
1990    2726492
1991    2437238
1992    2395814
1993    2259333
1994    2240086
1995    2165332
1996    2159555
1997    2074884
1998    1802931
1999    2337989
2000    2219407
2001    2295784
2002    2318051
2003    2242723
2004    1926235
2005    1990749
2006    2173907
2007    2078045
2008    2025358
2009    1873188
2010    1733015
2011    1721748
2012    1555281
2013    1520090
2014    1573594
2015    1589431
2016    1515602
2017    1472937
Name: 1, dtype: object